Repository: KDE/kiten
Catalog: po/*/kiten.po
Languages: ar, uk

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
uk: о. Іван Петрущак, Юрій Чорноіван

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
uk: fr.ivan@ukrainian-orthodox.org,yurchor@ukr.net

source: Dictionary Selector
ar: محدد القاموس
uk: Вибір словника

source: Use prei&nstalled dict
ar: استخدم القاموس المبدئي
uk: Використовувати вже вста&новлений dict

source: Name
ar: الاسم
uk: Назва

source: File
ar: ملف
uk: Файл

source: &Add...
ar: أ&ضف...
uk: &Додати...

source: Delete
ar: احذف
uk: Вилучити

source: Fonts
ar: الخطوط
uk: Шрифти

source: Main Font
ar: الخط الرئيس:
uk: Основний шрифт

source: Searching
ar: يبحث
uk: Пошук

source: Search for "jiten" on startup
ar: ابحث عن "jiten" عند بدء التشغيل
uk: Шукати слово«jiten» відразу після запуску

source: sorting
ar: الفرز
uk: сортування

source: Sort Se&arch Results By Dictionary
ar: رتب نتائج ال&بحث حسب القاموس
uk: Сортувати результати пош&уку за словником

source: Dicti&onaries Available:
ar: القواميس المتاحة:
uk: Доступні сл&овники:

source: Displa&y First:
ar: اعرض أولاً:
uk: Першими пока&зувати:

source: Fields to Sort &By:
ar: الحقول لل&فرز حسب:
uk: Поля, які слід сортувати з&а:

source: Dictionaries
ar: القواميس
uk: Словники

source: Font
ar: الخط
uk: Шрифт

# @title:group the settings for the dictionary display
source: Display
ar: العرض
uk: Показ

source: Results Sorting
ar: فرز النتائج
uk: Сортування результатів

source: Check for dictionary &updates
ar: تحقق من &تحديثات القاموس
uk: Виконати пошук &оновлень словників

source: Update canceled. Could not read file.
ar: أُلغِيَ التحديث. تعذر قراءة الملف.
uk: Оновлення скасовано. Не вдалося прочитати файл.

source: Update canceled. Could not open file.
ar: أُلغِيَ التحديث. تعذر فتح الملف.
uk: Оновлення скасовано. Не вдалося відкрити файл.

source: Update canceled. The update information file has an invalid date.
ar: أُلغِيَ التحديث. ملف معلومات التحديث يحتوي على تاريخ غير صالح.
uk: Оновлення скасовано. Вказано некоректну дату для файла даних щодо оновлення.

source: You already have the latest updates.
ar: لديك بالفعل أحدث التحديثات.
uk: Всі оновлення вже встановлено.

source: Successfully updated your dictionaries.
ar: نجحت عملية تحديث قواميسك.
uk: Ваші словники успішно оновлено.

source: Successfully updated: %1 Failed to update: %2
ar: نجح تحديث،: %1 فشل تحديث،: %2
uk: Успішно оновлено: %1 Не вдалося оновити: %2

source: Failed to update: %1
ar: فشل تحديث: %1
uk: Не вдалося оновити: %1

source: Radical Selector
ar: محدد جذري
uk: Вибір радикалів

source: Kanji Browser
ar: متصفح كانجي
uk: Переглядач кандзі

source: S&earch
ar: ا&بحث
uk: &Пошук

source: &Automatically Search Clipboard Selections
ar: ا&بحث آليًا عن مقاطع الحافظة
uk: &Автоматично шукати те, що потрапляє до кишені

source: Search &in Results
ar: ابحث &في النتائج
uk: Шукати &у результатах

source: Focus result view
ar: ركز عرض النتيجة
uk: Фокусувати перегляд результатів

source: Go to the previous search query.
ar: اذهب إلى استعلام البحث السابق.
uk: Перейти до попереднього запиту щодо пошуку.

source: Go to the next search query.
ar: اذهب إلى استعلام البحث التالي.
uk: Перейти до наступного запиту щодо пошуку.

source: Export List
ar: صدر القائمة
uk: Експортувати список

source: Initializing Dictionaries
ar: يهيئ القواميس
uk: Ініціалізація словників

source: Welcome to Kiten
ar: مرحبًا بك في كيتن
uk: Ласкаво просимо до Kiten

source: Searching...
ar: يبحث...
uk: Пошук...

source: Found 1 result
ar: لم يجد شيء
uk: Знайдено %1 результат

source: No results found
ar: لا نتائج
uk: Нічого не знайдено

source: List of dictionary Types, used internally, do not touch
ar: قائمة أنواع القواميس، تستخدم داخليًا، لا تلمسها
uk: Список типів словників; використовується у програмі, не чіпайте

source: Edict dictionary files
ar: ملفات قاموس Edict
uk: Файли словників Edict

source: Use preinstalled edict
ar: استخدم edict المثبتة مسبقًا
uk: Використовувати вже встановлений edict

source: Set of fields to display for this dictionary type
ar: مجموعة من الحقول للعرض لهذا النوع من القاموس
uk: Набір полів, які слід показувати для цього типу словника

source: Kanjidic dictionary files
ar: ملفات قاموس Kanjidic
uk: Файли словників Kanjidic

source: Use preinstalled kanjidic
ar: استخدم Kanjidic المثبتة مسبقًا
uk: Використовувати вже встановлений kanjidic

source: Do we search for "jiten" on startup
ar: هل نبحث عن "jiten" عند بدء التشغيل
uk: Чи шукати слово «jiten» одразу після запуску

source: Case sensitive searches
ar: البحث حساس لحالة الأحرف
uk: Пошук з врахуванням регістру

source: Enable Sorting By Dictionary
ar: مكن الفرز حسب القاموس
uk: Увімкнути впорядкування за словником

source: What order do we sort the dictionaries in?
ar: بأي ترتيب نفرز القواميس؟
uk: У якому порядку слід сортувати словники?

source: What order do we sort the fields in?
ar: بأي ترتيب نفرز الحقول؟
uk: У якому порядку сортувати поля?

source: 0=No filter, 1=Limit search results to "common" entries only, 2=Separate common and uncommon entries
ar: 0=دون تصفية، 1=تحديد نتائج البحث على المدخلات ”الشائعة“ فقط، 2=فصل المدخلات الشائعة عن غير الشائعة
uk: 0=Без фільтрування, 1=Обмежити результати пошуку лише типовими записами, 2=Відокремити типові і нетипові записи

source: The user's last type of search, 0=Exact, 1=Match Start, 2=Match End, 3=Match Anywhere
ar: آخر نوع بحث قام به المستخدم، 0=تطابق تام، 1=تطابق البداية، 2=تطابق النهاية، 3=تطابق في أي مكان
uk: Останній тип пошуку користувачем, 0=Точний, 1=Однаковий початок, 2=Однакове закінчення, 4=Однакова будь-яка частина

source: The user's last type of search, 0=Any, 1=Verb, 2=Noun, 3=Adjective, 4=Adverb, 5=Prefix, 6=Suffix, 7=Expression
ar: آخر نوع بحث قام به المستخدم، 0=أي شيء، 1=فعل، 2=اسم، 3=صفة، 4=ظرف، 5=بادئة، 6=لاحقة، 7=تعبير
uk: Останній тип пошуку користувачем, 0=Будь-яка, 1=Дієслово, 2=Іменник, 3=Прикметник, 4=Прислівник, 5=Префікс, 6=Суфікс, 7=Вираз

source: Automatically search for clipboard entries?
ar: هل تبحث آليًا عن مقاطع الحافظة؟
uk: Автоматично шукати те, що потрапляє до буфера?

source: &File
ar: &ملف
uk: &Файл

source: Main Toolbar
ar: شريط الأدوات الرئيس
uk: Головний пенал

source: Extra Toolbar
ar: شريط أدوات إضافي
uk: Додатковий пенал

source: Search Toolbar
ar: شريط أدوات البحث
uk: Панель пошуку

source: Search Options
ar: خيارات البحث
uk: Параметри пошуку

source: Kiten
ar: كيتن

source: Japanese Reference Tool
ar: مرجع ياباني/أداة دراسة
uk: Довідник та інструмент для вивчення японської

source: (c) 2001-2004, Jason Katz-Brown (c) 2006-2007, Eric Kjeldergaard (c) 2006-2008, Joseph Kerian (c) 2011, Daniel E. Moctezuma
ar: (ج) 2001-2004، جيسون كاتز-براون (ج) 2006-2007، إريك كيلديرغارد (ج) 2006-2008، جوزيف كيريان (ج) 2011، دانيال إ. موكتيزوما
uk: © Jason Katz-Brown, 2001–2004 © Eric Kjeldergaard, 2006–2007 © Joseph Kerian, 2006–2008 © Daniel E. Moctezuma, 2011

source: Jason Katz-Brown
ar: جيسون كاتز-براون

source: Original author
ar: المؤلف الأصلي
uk: Перший автор

source: Jim Breen
ar: جيم برين

source: Wrote xjdic, of which Kiten borrows code, and the xjdic index file generator. Also is main author of edict and kanjidic, which Kiten essentially require.
ar: كتب xjdic، الذي يستعير Kiten رموزه، ومولد ملفات فهرس xjdic. كما أنه المؤلف الرئيس لـ edict و kanjidic، اللذين يحتاجهما Kiten بشكل أساسي.
uk: Написав xjdic, з якого було позичено код для Kiten, та програму побудови індексу xjdic. Також він є головним автором edict та kanjidic, без яких неможливий Kiten.

source: Neil Stevens
ar: نيل ستيفنز

source: Code simplification, UI suggestions.
ar: تبسيط الشيفرة، اقتراحات لواجهة المستخدم.
uk: Спрощення коду, пропозиції щодо інтерфейсу.

source: David Vignoni
ar: ديفيد فيجنوني

source: svg icon
ar: أيقونات
uk: піктограма svg

source: Paul Temple
ar: بول تمبل

source: Porting to KConfig XT, bug fixing
ar: نقل إلى KConfig XT، إصلاح الأخطاء
uk: Портування до KConfig XT, виправлення помилок

source: Joseph Kerian
ar: جوزيف كريان

source: KDE4 rewrite
ar: إعادة كتابة لـ KDE4
uk: Переписування під KDE4

source: Eric Kjeldergaard
ar: إريك كيلديرغارد

source: Daniel E. Moctezuma
ar: دانيال إي. موكتيزوما

source: Deinflection system improvements, Dictionary updates for EDICT and KANJIDIC, GUI Improvements, Kanji Browser, Bug fixes, Code polishing and simplification
ar: تحسينات نظام إزالة الانحرافات، تحديثات القاموس لـ EDICT و KANJIDIC، تحسينات واجهة المستخدم الرسومية، متصفح كانجي، إصلاح الأخطاء، صقل وتبسيط الكود
uk: Покращення у системі усування закінчень, оновлення словників для EDICT і KANJIDIC, покращення у графічному інтерфейсі, переглядач кандзі, виправлення вад, покращення та спрощення коду.

source: Filter Type
ar: نوع المرشّح:
uk: Тип фільтрування

source: No filter
ar: لا مرشّح
uk: Без фільтрування

source: Filter out rare
ar: رشح النادر
uk: Фільтрувати рідкісні

source: Common/Uncommon
ar: شائع/غير شائع
uk: Типові/Нетипові

source: Match Type
ar: نوع المطابقة:
uk: Тип відповідності

source: Exact Match
ar: المطابقة التامة
uk: Повна відповідність

source: Match Beginning
ar: مطابقة البداية
uk: Однаковий початок

source: Match Ending
ar: مطابقة النهاية
uk: Однакове закінчення

source: Match Anywhere
ar: مطابقة في أي مكان
uk: Шукати всюди

source: Word Type
ar: نوع الكلمة
uk: Частина мови

source: Any
ar: أيّ
uk: Будь-яка

source: Verb
ar: فعل
uk: Дієслово

source: Noun
ar: اسم
uk: Іменник

source: Adjective
ar: صفة
uk: Прикметник

source: Adverb
ar: ظرف
uk: Прислівник

source: Prefix
ar: سابقة
uk: Префікс

source: Suffix
ar: لاحقة
uk: Суфікс

source: Expression
ar: عبارة
uk: Вираз

source: Focus input field
ar: ركز حقل الإدخال
uk: Фокусувати поле вводу

source: Search Bar
ar: شريط البحث
uk: Панель пошуку

source: %1 kanji found
ar: وجد %1 كانجي
uk: Знайдено %1 кандзі

source: About %1
ar: حول %1
uk: Про %1

source: Copy %1 to clipboard
ar: انسخ %1 إلى الحافظة
uk: Скопіювати %1 до буфера

source: Could not load the necessary kanji information.
ar: لا يمكن تحميل معلومات الكانجي الضرورية.
uk: Не вдалося завантажити потрібних даних кандзі.

source: Kanji &List
ar: &قائمة الكانجي
uk: С&писок кандзі

source: Kanji &Information
ar: &معلومات الكانجي
uk: &Дані щодо кандзі

source: &Search…
ar: ا&بحث…
uk: &Шукати…

source: All Jouyou Kanji grades
ar: جميع درجات كانجي جويو
uk: Всі класи повсякденних кандзі

source: Grade %1 (Jinmeiyou)
ar: درجة %1 (جينميو)
uk: Клас %1 (дзінмейо)

source: Grade %1
ar: درجة %1
uk: Клас %1

source: Not in Jouyou list
ar: ليس في قائمة جويو
uk: Не у списку повсякденних

source: No stroke limit
ar: لا يوجد حد لعدد الضربات
uk: Без обмеження щодо штрихів

source: %1 stroke
ar: %1 ضربة
uk: %1 риска

source: Grade:
ar: الدرجة:
uk: Клас:

source: Strokes:
ar: ضربات:
uk: Риски:

source: Onyomi:
ar: أونومي:
uk: Онйомі:

source: Kunyomi:
ar: كونيومي:
uk: Кунйомі:

source: In names:
ar: في الأسماء:
uk: У назвах:

source: As radical:
ar: كجذر:
uk: Як ключ:

source: Meaning:
ar: المعنى:
uk: Значення:

source: Meanings:
ar: المعاني:
uk: Значення:

source: Kiten's Kanji Browser, a KDE Japanese Reference Tool
ar: متصفح كانجي لـ كيتن، أداة مرجعية يابانية لـ كيدي
uk: Переглядач кандзі Kiten, довідника та інструмента для вивчення японської

source: (C) 2011 Daniel E. Moctezuma
ar: (C) 2011 دانيال إي. موكتيزوما
uk: © Daniel E. Moctezuma, 2011

source: Preferences
ar: تفضيلات
uk: Параметри

source: Kanji List
ar: قائمة كانجي
uk: Список кандзі

source: The font for the main kanji/kana entry in list view
ar: الخط لمدخل كانجي/كانا الرئيسي في عرض القائمة
uk: Шрифт для головного елемента кандзі або кана у перегляді списком

source: Use this to adjust the button font
ar: استخدم هذا لضبط خط الزر
uk: Скористайтеся для налаштовування шрифту кнопок

source: Kanji font:
ar: خط كانجي:
uk: Шрифт кандзі:

source: Kanji Information
ar: معلومات كانجي
uk: Дані щодо кандзі

source: Kanji size:
ar: حجم كانجي:
uk: Розмір кандзі:

source: Kana font:
ar: خط كانا:
uk: Шрифт кани:

source: Label font:
ar: خط اللاصقة:
uk: Шрифт міток:

source: Search
ar: بحث
uk: Пошук

source: Enter a search query:
ar: أدخل استعلام بحث:
uk: Введіть запит щодо пошуку:

source: verb
ar: فعل
uk: дієслово

source: adjective
ar: الصّفات
uk: прикметник

source: Verb deinflection information not found, so verb deinflection cannot be used.
ar: لا يوجد فك تعمية للفعل.
uk: Інформацію про виключення закінчення з дієслова не знайдено, тому виключення не може бути використане.

source: Verb deinflection information could not be loaded, so verb deinflection cannot be used.
ar: لا يمكن تحميل فك تعمية الفعل.
uk: Інформацію про виключення закінчення з дієслова неможливо завантажити, тому виключення не може бути використане.

source: &Available Fields:
ar: &الحقول المتاحة:
uk: &Доступні поля:

source: From Dictionary:
ar: من القاموس:
uk: Зі словника:

source: Entered %1 in %2 form
ar: أدخل %1 في شكل %2
uk: Введено %1 у формі %2

source: Common
ar: شائع
uk: Типові

source: Uncommon
ar: غير شائع
uk: Нетипові

source: No Radicals Selected
ar: لا جذور محددة
uk: Не вибрано ключів

source: Selected Radicals:
ar: الجذور المحددة:
uk: Вибрані ключі:

source: A KDE Application
ar: تطبيق كِيدِي
uk: Програма KDE

source: (C) 2005 Joseph Kerian
ar: (C) 2005 جوزيف كريان
uk: © Joseph Kerian, 2005

source: Electronic Dictionary Research and Development Group
ar: مجموعة أبحاث وتطوير القاموس الإلكتروني

source: This program uses the KANJIDIC and RADKFILE dictionary files. These files are the property of the Electronic Dictionary Research and Development Group, and are used in conformance with the Group's licence.
ar: يستخدم هذا البرنامج ملفات القاموس KANJIDIC و RADKFILE. هذه الملفات مملوكة لمجموعة أبحاث وتطوير القواميس الإلكترونية، وتستخدم وفقًا لترخيص المجموعة.
uk: У цій програмі використано файли словників KANJIDIC і RADKFILE. Ці файли є власністю Electronic Dictionary Research and Development Group і використовуються за умов ліцензування цієї групи.

source: Initial Search String from Kiten
ar: سلسلة البحث المبدئية من كيتن
uk: Початковий рядок пошуку від Kiten

source: RadicalSelector
ar: محدد جذري

source: Results
ar: النّتائج
uk: Результати

source: &To Clipboard
ar: إلى ال&حافظة
uk: &До буфера обміну

source: Clear
ar: امحُ
uk: Очистити

source: Display radicals in descending frequency order
ar: اعرض الجذور بترتيب تنازلي للتردد
uk: Показувати радикали за спаданням частоти використання

source: Do we close this program when searching?
ar: هل نغلق هذا البرنامج عند البحث؟
uk: Чи закривати цю програму під час пошуку?

source: Close radselect when you press search
ar: أغلق محدد الجذور عندما تضغط على بحث
uk: Закрити radselect, коли ви натиснете кнопку пошуку

source: Search Results Font:
ar: خط نتائج البحث:
uk: Шрифт результатів пошуку:

source: Use this to adjust the result list font
ar: استخدم هذا لضبط خط قائمة النتائج
uk: Скористайтеся цим параметром для налаштовування шрифту списку результатів

source: Button Font:
ar: خط الزر:
uk: Шрифт кнопок:

source: Kanji radical information does not seem to be installed (file kiten/radkfile), this file is required for this app to function.
ar: بدو أن معلومات جذور الكانجي غير مثبتة (ملف kiten/radkfile)، وهذا الملف ضروري لتشغيل هذا التطبيق.
uk: Інформацію про ключі кандзі, здається, не встановлено (файл kiten/radkfile), цей файл потрібний для належного функціонування програми

source: Kanji dictionary does not seem to be installed (file kiten/kanjidic), stroke count information will be unavailable.
ar: يبدو أن قاموس الكانجي غير مثبت (ملف kiten/kanjidic)، ولن تتوفر معلومات عدد الضربات.
uk: Здається, у системі не встановлено словника кандзі (файла kiten/kanjidic). У вас не буде доступу до даних щодо кількості штрихів у ієрогліфі.

# Minimum number of strokes for a kanji
source: Min
ar: الأدنى
uk: Мін.

# Maximum number of strokes for a kanji
source: Max
ar: الأقصى
uk: Макс.

# @item:inlist all matches should be found
source: (ALL)
ar: (الكل)
uk: (ВСІ)

source: 漢字 かな romaji
uk: 漢字 かな ромадзі
